hexTankFlow/system/blockMeshDict
FoamFile
{
		version 2.0;
		format	ascii;
		class	dictionary;
		object	blockMeshDict;
}


convertToMeters 0.001;

vertices
(
 // vertices for block 1, point 0 ~ 7
	(-10	35	0)
	(0	35	0)
	(0	40	0)
	(-10	40	0)
	(-10	35	1)
	(0	35	1)
	(0	40	1)
	(-10	40	1)

	// vertices for block 2, point 8 - 15
	(0 0 0)
	(10 0 0)
	(10 50 0)
	(0 50 0)
	(0 0 1)
	(10 0 1)
	(10 50 1)
	(0 50 1)

	// vertices for block 3, point 16 - 23
	(10 20 0)
	(90 20 0)
	(90 22 0)
	(10 22 0)
	(10 20 1)
	(90 20 1)
	(90 22 1)
	(10 22 1)

	// vertices for block 4, point 24 ~ 31
	(10 28 0)
	(90 28 0)
	(90 30 0)
	(10 30 0)
	(10 28 1)
	(90 28 1)
	(90 30 1)
	(10 30 1)

	// vertices for block 5, point 32 ~ 39
	(90 0 0)
	(100 0 0)
	(100 50 0)
	(90 50 0)
	(90 0 1)
	(100 0 1)
	(100 50 1)
	(90 50 1)

	// vertices for block 6, point 40 ~ 47
	(100 10 0)
	(110 10 0)
	(110 15 0)
	(100 15 0)
	(100 10 1)
	(110 10 1)
	(110 15 1)
	(100 15 1)
);

blocks
(
	hex (0  1  2  3  4  5  6  7) (10 5 1) simpleGrading (1 1 1)
	hex (8   9 10 11 12 13 14 15) (10 50 1) simpleGrading (1 1 1)
	hex (16 17 18 19 20 21 22 23) (80 2 1) simpleGrading (1 1 1)
	hex (24 25 26 27 28 29 30 31) (80 2 1) simpleGrading (1 1 1)
	hex (32 33 34 35 36 37 38 39) (10 50 1) simpleGrading (1 1 1)
	hex (40 41 42 43 44 45 46 47) (10 5 1) simpleGrading (1 1 1)
);



boundary
(
 inlet
 {
	type patch;
	faces
		(
		 (0 4 7 3)
		);
	}

	outlet
	{
		type patch;
		faces
			(
			 (41 42 46 45)
			);
	}
			 
	walls
	{
		type wall;
		faces
			(
			 // from block 1
			 (0 1 5 4)
			 (3 7 6 2)

			 // from block 2
			 (8 9 13 12)
			 (11 15 14 10)

			 //from block 3
			 (16 17 21 20)
			 (19 23 22 18)

			 //from block 4
			 (25 29 28 24)
			 (27 31 30 26)

			 //from block 5
			 (33 37 36 32)
			 (35 39 38 34)

			 //from block 6
			 (41 45 44 40)
			 (43 47 46 42)
			);
	}

 slave_1
{
	type wall;
	faces
		(
		 (2 6 5 1)
		);
}

 walls_m1
{
	type wall;
	faces
		(
			 (8 12 15 11)
		);
}

 slave_2
{
	type wall;
	faces
		(
		 (28 31 27 24)
		 (20 23 19 16)
		);
}

 walls_m2
{
	type wall;
	faces
		(
			 (14 13 9 10)
		);
}

slave_3
{
	type wall;
	faces
		(
		 (22 21 17 18)
		 (30 29 25 26)
		);
}

 walls_m3
{
	type wall;
	faces
		(
			 (39 35 32 36)
		);
}

slave_4
{
	type wall;
	faces
		(
		 (47 44 40 43)
		);
}

 walls_m4
{
	type wall;
	faces
		(
			 (38 37 33 34)
		);
}


);

mergePatchPairs
(
 (walls_m1 slave_1)
 (walls_m2 slave_2)
 (walls_m3 slave_3)
 (walls_m4 slave_4)
);

